IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_SDFM1_CONTROLSS_SDFM1.xml
<module name="CONTROLSS_SDFM1_CONTROLSS_SDFM1" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_SDFM1_SDIFLG" acronym="CONTROLSS_SDFM1_SDIFLG" offset="0x0" width="32" description="">
		<bitfield id="MIF" width="1" begin="31" end="31" resetval="0x0" description="Set whenever any 'error' interrupt (MF1-4,IFL1-4,IFH1-4,SDFFOVF1-4) is active" range="31" rwaccess="RO"/> 
		<bitfield id="SDFFINT4" width="1" begin="23" end="23" resetval="0x0" description="SDFIFO data ready interrupt for Ch4" range="23" rwaccess="RO"/> 
		<bitfield id="SDFFINT3" width="1" begin="22" end="22" resetval="0x0" description="SDFIFO data ready interrupt for Ch3" range="22" rwaccess="RO"/> 
		<bitfield id="SDFFINT2" width="1" begin="21" end="21" resetval="0x0" description="SDFIFO data ready interrupt for Ch2" range="21" rwaccess="RO"/> 
		<bitfield id="SDFFINT1" width="1" begin="20" end="20" resetval="0x0" description="SDFIFO data ready interrupt for Ch1   0:  SDFIFO data ready interrupt has NOT occurred  1:  SDFIFO data ready interrupt has occurred" range="20" rwaccess="RO"/> 
		<bitfield id="SDFFOVF4" width="1" begin="19" end="19" resetval="0x0" description="FIFO Overflow Flag for Ch4" range="19" rwaccess="RO"/> 
		<bitfield id="SDFFOVF3" width="1" begin="18" end="18" resetval="0x0" description="FIFO Overflow Flag for Ch3" range="18" rwaccess="RO"/> 
		<bitfield id="SDFFOVF2" width="1" begin="17" end="17" resetval="0x0" description="FIFO Overflow Flag for Ch2" range="17" rwaccess="RO"/> 
		<bitfield id="SDFFOVF1" width="1" begin="16" end="16" resetval="0x0" description="FIFO Overflow Flag for Ch1  0 - FIFO has not overflowed  1 - FIFO overflowed.  # words received in FIFO ' FIFO depth (16), NEW word is lost" range="16" rwaccess="RO"/> 
		<bitfield id="AF4" width="1" begin="15" end="15" resetval="0x0" description="Acknowledge flag for Filter 4  0: No new data available for Filter  (in non-FIFO mode)  1: New data available for Filter  (in non-FIFO mode)" range="15" rwaccess="RO"/> 
		<bitfield id="AF3" width="1" begin="14" end="14" resetval="0x0" description="Acknowledge flag for Filter 3  0: No new data available for Filter  (in non-FIFO mode)  1: New data available for Filter  (in non-FIFO mode)" range="14" rwaccess="RO"/> 
		<bitfield id="AF2" width="1" begin="13" end="13" resetval="0x0" description="Acknowledge flag for Filter 2  0: No new data available for Filter  (in non-FIFO mode)  1: New data available for Filter  (in non-FIFO mode)" range="13" rwaccess="RO"/> 
		<bitfield id="AF1" width="1" begin="12" end="12" resetval="0x0" description="Acknowledge flag for Filter 1  0: No new data available for Filter (in non-FIFO mode)  1: New data available for Filter (in non-FIFO mode)" range="12" rwaccess="RO"/> 
		<bitfield id="MF4" width="1" begin="11" end="11" resetval="0x0" description="Modulator Failure for Filter 4  0: Modulator is operating normally for Filter  1: Modulator failure for Filter" range="11" rwaccess="RO"/> 
		<bitfield id="MF3" width="1" begin="10" end="10" resetval="0x0" description="Modulator Failure for Filter 3  0: Modulator is operating normally for Filter  1: Modulator failure for Filter" range="10" rwaccess="RO"/> 
		<bitfield id="MF2" width="1" begin="9" end="9" resetval="0x0" description="Modulator Failure for Filter 2  0: Modulator is operating normally for Filter  1: Modulator failure for Filter" range="9" rwaccess="RO"/> 
		<bitfield id="MF1" width="1" begin="8" end="8" resetval="0x0" description="Modulator Failure for Filter 1  0: Modulator is operating normally for Filter  1: Modulator failure for Filter" range="8" rwaccess="RO"/> 
		<bitfield id="FLT4_FLG_CEVT2" width="1" begin="7" end="7" resetval="0x0" description="CEVT2 Interrupt flag for filter4  0: CEVT2 event has not occured  1: CEVT2  event has occurred" range="7" rwaccess="RO"/> 
		<bitfield id="FLT4_FLG_CEVT1" width="1" begin="6" end="6" resetval="0x0" description="CEVT1 Interrupt flag for filter4  0: CEVT1 event has not occured  1: CEVT1  event has occurred" range="6" rwaccess="RO"/> 
		<bitfield id="FLT3_FLG_CEVT2" width="1" begin="5" end="5" resetval="0x0" description="CEVT2 Interrupt flag for filter3  0: CEVT2 event has not occured  1: CEVT2  event has occurred" range="5" rwaccess="RO"/> 
		<bitfield id="FLT3_FLG_CEVT1" width="1" begin="4" end="4" resetval="0x0" description="CEVT1 Interrupt flag for filter3  0: CEVT1 event has not occured  1: CEVT1  event has occurred" range="4" rwaccess="RO"/> 
		<bitfield id="FLT2_FLG_CEVT2" width="1" begin="3" end="3" resetval="0x0" description="CEVT2 Interrupt flag for filter2  0: CEVT2 event has not occured  1: CEVT2  event has occurred" range="3" rwaccess="RO"/> 
		<bitfield id="FLT2_FLG_CEVT1" width="1" begin="2" end="2" resetval="0x0" description="CEVT1 Interrupt flag for filter2  0: CEVT1 event has not occured  1: CEVT1  event has occurred" range="2" rwaccess="RO"/> 
		<bitfield id="FLT1_FLG_CEVT2" width="1" begin="1" end="1" resetval="0x0" description="CEVT2 Interrupt flag for filter1  0: CEVT2 event has not occured  1: CEVT2  event has occurred" range="1" rwaccess="RO"/> 
		<bitfield id="FLT1_FLG_CEVT1" width="1" begin="0" end="0" resetval="0x0" description="CEVT1 Interrupt flag for filter1  0: CEVT1 event has not occured  1: CEVT1  event has occurred" range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDIFLGCLR" acronym="CONTROLSS_SDFM1_SDIFLGCLR" offset="0x4" width="32" description="">
		<bitfield id="MIF" width="1" begin="31" end="31" resetval="0x0" description="Flag-clear bit for SDFM Master Interrupt flag.   Writing a  1 to clear MIF flag in SDIFLG register  Writes of '0' are ignored.  Note: If the MIF flag is cleared and other Interrupts are still pending, MIF will again be set to 1 on the following SysClk cycle, and the INT output will be reasserted (pulsed low)" range="31" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SDFFINT4" width="1" begin="23" end="23" resetval="0x0" description="SDFIFO data ready Interrupt flag-clear bit for Ch4" range="23" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SDFFINT3" width="1" begin="22" end="22" resetval="0x0" description="SDFIFO data ready Interrupt flag-clear bit for Ch3" range="22" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SDFFINT2" width="1" begin="21" end="21" resetval="0x0" description="SDFIFO data ready Interrupt flag-clear bit for Ch2" range="21" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SDFFINT1" width="1" begin="20" end="20" resetval="0x0" description="SDFIFO data ready Interrupt flag-clear bit for Ch1" range="20" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SDFFOVF4" width="1" begin="19" end="19" resetval="0x0" description="SDFIFO overflow clear Ch4" range="19" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SDFFOVF3" width="1" begin="18" end="18" resetval="0x0" description="SDFIFO overflow clear Ch3" range="18" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SDFFOVF2" width="1" begin="17" end="17" resetval="0x0" description="SDFIFO overflow clear Ch2" range="17" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SDFFOVF1" width="1" begin="16" end="16" resetval="0x0" description="SDFIFO overflow clear Ch1" range="16" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="AF4" width="1" begin="15" end="15" resetval="0x0" description="Flag-clear bit for Acknowledge flag for Filter 4" range="15" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="AF3" width="1" begin="14" end="14" resetval="0x0" description="Flag Clear bit for AF3" range="14" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="AF2" width="1" begin="13" end="13" resetval="0x0" description="Flag Clear bit for AF2" range="13" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="AF1" width="1" begin="12" end="12" resetval="0x0" description="Flag Clear bit for AF1" range="12" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MF4" width="1" begin="11" end="11" resetval="0x0" description="Flag Clear bit for MF4" range="11" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MF3" width="1" begin="10" end="10" resetval="0x0" description="Flag Clear bit for MF3" range="10" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MF2" width="1" begin="9" end="9" resetval="0x0" description="Flag Clear bit for MF2" range="9" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="MF1" width="1" begin="8" end="8" resetval="0x0" description="Flag Clear bit for MF1" range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="FLT4_FLG_CEVT2" width="1" begin="7" end="7" resetval="0x0" description="Flag Clear bit for FLT4_FLG_CEVT2" range="7" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="FLT4_FLG_CEVT1" width="1" begin="6" end="6" resetval="0x0" description="Flag Clear bit for FLT4_FLG_CEVT1" range="6" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="FLT3_FLG_CEVT2" width="1" begin="5" end="5" resetval="0x0" description="Flag Clear bit for FLT3_FLG_CEVT2" range="5" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="FLT3_FLG_CEVT1" width="1" begin="4" end="4" resetval="0x0" description="Flag Clear bit for FLT3_FLG_CEVT1" range="4" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="FLT2_FLG_CEVT2" width="1" begin="3" end="3" resetval="0x0" description="Flag Clear bit for FLT2_FLG_CEVT2" range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="FLT2_FLG_CEVT1" width="1" begin="2" end="2" resetval="0x0" description="Flag Clear bit for FLT2_FLG_CEVT1" range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="FLT1_FLG_CEVT2" width="1" begin="1" end="1" resetval="0x0" description="Flag Clear bit for FLT1_FLG_CEVT2" range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="FLT1_FLG_CEVT1" width="1" begin="0" end="0" resetval="0x0" description="Flag Clear bit for FLT1_FLG_CEVT1" range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDCTL" acronym="CONTROLSS_SDFM1_SDCTL" offset="0x8" width="16" description="">
		<bitfield id="MIE" width="1" begin="13" end="13" resetval="0x0" description="Master SDy_ERR interrupt enable  0: SDy_ERR Interrupt and interrupt flags are disabled  1: SDy_ERR Interrupt and interrupt flags are enabled" range="13" rwaccess="RW"/> 
		<bitfield id="HZ4" width="1" begin="3" end="3" resetval="0x0" description="Flag Clear bit for HZ4" range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="HZ3" width="1" begin="2" end="2" resetval="0x0" description="Flag Clear bit for HZ3" range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="HZ2" width="1" begin="1" end="1" resetval="0x0" description="Flag Clear bit for HZ2" range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="HZ1" width="1" begin="0" end="0" resetval="0x0" description="Flag Clear bit for HZ1" range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDMFILEN" acronym="CONTROLSS_SDFM1_SDMFILEN" offset="0xC" width="16" description="">
		<bitfield id="MFE" width="1" begin="11" end="11" resetval="0x0" description="Master Filter Enable  0: All the four data filter units of SDFM module are disabled. All FIFOs      are cleared  1: Data filter units can be enabled if bit FEN is '1'." range="11" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDSTATUS" acronym="CONTROLSS_SDFM1_SDSTATUS" offset="0xE" width="16" description="">
		<bitfield id="HZ4" width="1" begin="3" end="3" resetval="0x0" description="High-level Threshold crossing (Z) flag Ch4  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator IFHx flag, it does not have the ability to generate an interrupt.  0: Comparator filter output '    SDCMPHZ4.HLTZ  1: Comparator filter output '=  SDCMPHZ4.HLTZ" range="3" rwaccess="RO"/> 
		<bitfield id="HZ3" width="1" begin="2" end="2" resetval="0x0" description="High-level Threshold crossing (Z) flag Ch3  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator IFHx flag, it does not have the ability to generate an interrupt.  0: Comparator filter output '    SDCMPHZ3.HLTZ  1: Comparator filter output '=  SDCMPHZ3.HLTZ" range="2" rwaccess="RO"/> 
		<bitfield id="HZ2" width="1" begin="1" end="1" resetval="0x0" description="High-level Threshold crossing (Z) flag Ch2  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator IFHx flag, it does not have the ability to generate an interrupt.  0: Comparator filter output '    SDCMPHZ2.HLTZ  1: Comparator filter output '=  SDCMPHZ2.HLTZ" range="1" rwaccess="RO"/> 
		<bitfield id="HZ1" width="1" begin="0" end="0" resetval="0x0" description="High-level Threshold crossing (Z) flag Ch1  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator IFHx flag, it does not have the ability to generate an interrupt.  0: Comparator filter output '    SDCMPHZ1.HLTZ  1: Comparator filter output '=  SDCMPHZ1.HLTZ" range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDCTLPARM1" acronym="CONTROLSS_SDFM1_SDCTLPARM1" offset="0x20" width="16" description="">
		<bitfield id="SDDATASYNC" width="1" begin="6" end="6" resetval="0x0" description="0: SD Data is not passed through a synchronizer. 1: SD Data is passed through a synchronizer." range="6" rwaccess="RW"/> 
		<bitfield id="SDCLKSYNC" width="1" begin="4" end="4" resetval="0x0" description="0: SD Clock is not passed through a synchronizer. 1: SD Clock is passed through a synchronizer." range="4" rwaccess="RW"/> 
		<bitfield id="SDCLKSEL" width="1" begin="3" end="3" resetval="0x0" description="SD1 Clock source select. 0: Clock source to SDFM filter is its channel clock. 1: Clock source to SDFM filter is SD1 filter clock." range="3" rwaccess="RW"/> 
		<bitfield id="MOD" width="2" begin="1" end="0" resetval="0x0" description="Modulator clock modes  0: Mode 0: Modulator clock running at 1x data rate 1: Reserved 2: Reserved 3: Reserved" range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDDFPARM1" acronym="CONTROLSS_SDFM1_SDDFPARM1" offset="0x22" width="16" description="">
		<bitfield id="SDSYNCEN" width="1" begin="12" end="12" resetval="0x0" description="PWM synchronization (SDSYNC) of data filter  0: PWM synchronization  of data filter is disabled  1: PWM synchronization of data filter is enabled  Note: SDSYNCx.SYNCSEL bits define which PWM signal is used to              synchronize PWMs" range="12" rwaccess="RW"/> 
		<bitfield id="SST" width="2" begin="11" end="10" resetval="0x0" description="Data filter structure  00: Data filter runs with a Sincfast structure 01: Data filter runs with a Sinc1 structure 10: Data filter runs with a Sinc2 structure 11: Data filter runs with a Sinc3 structure" range="11 - 10" rwaccess="RW"/> 
		<bitfield id="AE" width="1" begin="9" end="9" resetval="0x0" description="Data filter Acknowledge Enable  0: Acknowledge flag is disabled for the particular filter  1: Acknowledge flag is enabled for the particular filter" range="9" rwaccess="RW"/> 
		<bitfield id="FEN" width="1" begin="8" end="8" resetval="0x0" description="Filter Enable  0:  The data filter is disabled and no data is produced  1:  The data filter is enabled and data are produced in the data filter  Note: When filter is disabled, DOSR counter held in reset, filter data          erased. Also resets FIFO pointers and clears the FIFO" range="8" rwaccess="RW"/> 
		<bitfield id="DOSR" width="8" begin="7" end="0" resetval="0x0" description="Data filter Oversampling ratio  The actual oversampling ratio of data filter is DOSR + 1  These bits set the oversampling ratio of the data filter. 0x0FF represents an oversampling ratio of 256." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDDPARM1" acronym="CONTROLSS_SDFM1_SDDPARM1" offset="0x24" width="16" description="">
		<bitfield id="SH" width="5" begin="15" end="11" resetval="0x0" description="Shift Control These bits indicate by how many bits the 16-bit window is shifted up when 16-bit data representation is chosen." range="15 - 11" rwaccess="RW"/> 
		<bitfield id="DR" width="1" begin="10" end="10" resetval="0x0" description="Data filter Data representation  0: Data stored in 16b 2's complement  1: Data stored in 32b 2's complement" range="10" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDFLT1CMPH1" acronym="CONTROLSS_SDFM1_SDFLT1CMPH1" offset="0x26" width="16" description="">
		<bitfield id="HLT" width="15" begin="14" end="0" resetval="0x32767" description="Unsigned high-level threshold for the comparator filter output." range="14 - 0" rwaccess="RW"/>
	</register>
