IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_SDFM1_CONTROLSS_SDFM1.xml
	<register id="CONTROLSS_SDFM1_SDDATA4" acronym="CONTROLSS_SDFM1_SDDATA4" offset="0x8C" width="32" description="">
		<bitfield id="DATA32HI" width="16" begin="31" end="16" resetval="0x0" description="Hi-order 16b in 32b mode, 16-bit Data in 16b mode" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Lo-order 16b in 32b mode" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDDATFIFO4" acronym="CONTROLSS_SDFM1_SDDATFIFO4" offset="0x90" width="32" description="">
		<bitfield id="DATA32HI" width="16" begin="31" end="16" resetval="0x0" description="Hi-order 16b in 32b mode, 16-bit Data in 16b mode" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Lo-order 16b in 32b mode" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDCDATA4" acronym="CONTROLSS_SDFM1_SDCDATA4" offset="0x94" width="16" description="">
		<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Comparator Data output - 16b only" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDFLT4CMPH2" acronym="CONTROLSS_SDFM1_SDFLT4CMPH2" offset="0x96" width="16" description="">
		<bitfield id="HLT2" width="15" begin="14" end="0" resetval="0x32767" description="Second Unsigned high-level threshold for the comparator filter output." range="14 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDFLT4CMPHZ" acronym="CONTROLSS_SDFM1_SDFLT4CMPHZ" offset="0x98" width="16" description="">
		<bitfield id="HLTZ" width="15" begin="14" end="0" resetval="0x0" description="Unsigned High-level threshold (Z) for the comparator filter output  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator SDCMPHx, it does not have the ability to generate an interrupt." range="14 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDFIFOCTL4" acronym="CONTROLSS_SDFM1_SDFIFOCTL4" offset="0x9A" width="16" description="">
		<bitfield id="OVFIEN" width="1" begin="15" end="15" resetval="0x0" description="SDFIFO Overflow interrupt enable  0: SDFIFO Overflow condition will not generate an interrupt  1: SDFIFO overflow condition generates an interrupt on SDy_ERR" range="15" rwaccess="RW"/> 
		<bitfield id="DRINTSEL" width="1" begin="14" end="14" resetval="0x0" description="Data-Ready Interrupt (DRINT) source select  0 = AF1          (Select non-FIFO data-ready interrupt)  1 = SDFFINT1 (Select FIFO data-ready interrupt)" range="14" rwaccess="RW"/> 
		<bitfield id="FFEN" width="1" begin="13" end="13" resetval="0x0" description="SDFIFO Enable  0:  Disable FIFO operation 1:  Enable FIFO operation  Note: When FIFO is disabled, FIFO contents are cleared" range="13" rwaccess="RW"/> 
		<bitfield id="FFIEN" width="1" begin="12" end="12" resetval="0x0" description="SDFIFO data ready Interrupt Enable" range="12" rwaccess="RW"/> 
		<bitfield id="SDFFST" width="5" begin="10" end="6" resetval="0x0" description="SDFIFO Status  00000 FIFO empty 00001 FIFO has 1 word  . . . . 10000 FIFO has 16 words" range="10 - 6" rwaccess="RO"/> 
		<bitfield id="SDFFIL" width="5" begin="4" end="0" resetval="0x0" description="SDFIFO interrupt level bits   The FIFO will generate an interrupt when the FIFO status (SDFFST) '= FIFO level (SDFFIL )" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDSYNC4" acronym="CONTROLSS_SDFM1_SDSYNC4" offset="0x9C" width="16" description="">
		<bitfield id="WTSCLREN" width="1" begin="10" end="10" resetval="0x1" description="WTSYNFLG Clear-on-FIFOINT Enable  0: WTSYNFLG can only be cleared manually (using WTSYNCLR bit)  1: WTSYNFLG is cleared automatically on SDFFINT" range="10" rwaccess="RW"/> 
		<bitfield id="FFSYNCCLREN" width="1" begin="9" end="9" resetval="0x0" description="FIFO Clear-on-SDSYNC Enable  0: SDFIFO is not automaticaly cleared upon receiving SDSYNC   1: SDFIFO is automaticaly cleared upon receiving SDSYNC" range="9" rwaccess="RW"/> 
		<bitfield id="WTSYNCLR" width="1" begin="8" end="8" resetval="0x0" description="Wait-for-Sync Flag Clear (always reads 0)  0: Write of 0 has no affect  1: Write of 1 clears WTSYNFLG" range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="WTSYNFLG" width="1" begin="7" end="7" resetval="0x0" description="Wait-for-Sync Flag  0: SDSYNC event has not occurred  1: SDSYNC event occurred." range="7" rwaccess="RO"/> 
		<bitfield id="WTSYNCEN" width="1" begin="6" end="6" resetval="0x0" description="Wait-for-Sync Enable  0: Incoming Data written to SDFIFO on every Data-Ready (DR) Event  1: Incoming Data written to SDFIFO on DR event only after SDSYNC event occurs" range="6" rwaccess="RW"/> 
		<bitfield id="SYNCSEL" width="6" begin="5" end="0" resetval="0x0" description="Defines source for the SDSYNC Input on this channel  Refer SDSYNCx.SYNCSEL table" range="5 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDFLT4CMPL2" acronym="CONTROLSS_SDFM1_SDFLT4CMPL2" offset="0x9E" width="16" description="">
		<bitfield id="LLT2" width="15" begin="14" end="0" resetval="0x0" description="Second Unsigned low-level threshold for the comparator filter output." range="14 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDCOMP1CTL" acronym="CONTROLSS_SDFM1_SDCOMP1CTL" offset="0xC0" width="16" description="">
		<bitfield id="CEVT2DIGFILTSEL" width="2" begin="11" end="10" resetval="0x0" description="High comparator COMPH source select.    0  CEVT2 output drives COMPLOUT   1  Reserved   2  Output of digital filter drives COMPLOUT   3  Reserved" range="11 - 10" rwaccess="RW"/> 
		<bitfield id="CEVT1DIGFILTSEL" width="2" begin="3" end="2" resetval="0x0" description="High comparator COMPH source select.    0  CEVT1 output drives COMPHOUT   1  Reserved   2  Output of digital filter drives COMPHOUT   3  Reserved" range="3 - 2" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDCOMP1EVT2FLTCTL" acronym="CONTROLSS_SDFM1_SDCOMP1EVT2FLTCTL" offset="0xC2" width="16" description="">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="Low filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="Low filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state." range="13 - 9" rwaccess="RW"/> 
		<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="Low filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8 - 4" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDCOMP1EVT2FLTCLKCTL" acronym="CONTROLSS_SDFM1_SDCOMP1EVT2FLTCLKCTL" offset="0xC4" width="16" description="">
		<bitfield id="CLKPRESCALE" width="10" begin="9" end="0" resetval="0x0" description="Low filter sample clock prescale. Number of system clocks between samples." range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_SDFM1_SDCOMP1EVT1FLTCTL" acronym="CONTROLSS_SDFM1_SDCOMP1EVT1FLTCTL" offset="0xC6" width="16" description="">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="High filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="High filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state." range="13 - 9" rwaccess="RW"/> 
		<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="High filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8 - 4" rwaccess="RW"/>
	</register>
